const delay = (ms) => new Promise(res => setTimeout(res, ms));

// active loop storage
const activeMurgi = new Map();

module.exports = {
  config: {
    name: "murgi",
    version: "1.1.0",
    role: 2,
    author: "MAMUN",
    description: "Loop bad word messages until stopped",
    category: "fun",
    usages: "@mention | off",
    cooldowns: 5,
  },

  onStart: async function({ message, event, args }) {
    // OFF command
    if (args[0] && args[0].toLowerCase() === "off") {
      if (activeMurgi.has(event.threadID)) {
        activeMurgi.set(event.threadID, false);
        return message.reply("🛑 ওকে সিয়াম বস মাগী কে আর চুদবো না.");
      } else {
        return message.reply("⚠️ Murgi mode is not running.");
      }
    }

    const mention = Object.keys(event.mentions)[0];
    if (!mention) {
      return message.reply("কোন মাগির ছেলেকে চুদবো বস আপনি শুধু মেনশন দিন 🥵💦");
    }

    const name = event.mentions[mention];
    const arraytag = [{ id: mention, tag: name }];

    const messages = [
      "খা*নকির ছেলে রেডি তো চু*দা খাওয়ার জন্য 😈 ",
      "এখন তোর মার দুধ দরে ঘুমামু সকালে তোরে পুকটি মারতে জামু গুড নাইট ছোট 😚",
      "শুন খানকির ছেলে ইডেট করতে করতে মইরা যা পোস্ট কইরা ফেমাস কর আমারে, 🙄",
      "গালাগালি করতে করতে তোর বুরি মারে সস্তা বানিয়ে ফেলছস",
      "এই ইহুদি এসব ছাড়া খানকির ছেলে কি পারছ 👅 🙁",
      "─────কানা তোর মার কালা পুশির যে গন্ধ তুই এটা দিয়ে কিভাবে বের হইলি শালি আবার ডুকে যা 🤣",
      "─────তোর আব্বুর এর নাম নিয়ে আর কতো চলবি গরিবের বাচ্চা🤣",
      "─────ফকিন্নির ছেলে টিনের ঘরের মুচি🤣",
      "─────তোর মার মতো বেড়ি আমার ধনের গোড়ার বাল কাটতে রাখি তোর মতো মাগির যোগ্যতা ও নাই🤣",
      "তর মারে ১২ মাস চুদে গেলেও ওর ভোদার কিছু হবে না কারন মাগি তো ভোদা লোহা বানায় দিছে 😹💥🦶",
      "────তোর মারে চুইদা তোরে বানাইছি 🙂😝",
      "️️️️️⎯⎯খানকির ছেলে সিন না দিলে তোর মার বোদা কামড়ায়া খেয়ে ফেলবো। 😂😦",
      "—♡শেষ নিশ্বাস পর্যন্ত আপনার মাকে চুদতে  চাই কি বলেন আপনি-!! ">"♡🩷🙂🫶",
      "বিশ্বার বাচ্চা তোর মায়ের কালা সিটায় তোরে আবার ভরে দিমু 👉🏿👌🏿👅",
      " তোর মারে নিয়ে কালকো চুদবো আর পোস্ট দিমু🤡",
      " নডির ছেলে সময় থাকতে ভালো হো খানকির ছেলে ফেরাউনের বাচ্চা গালাগালি করা সভাব হয়ে গেছে চুইদ্দা কিন্তু মাইরা লামু",
      " তোর লেংটা মায়রে বিলাইয়ের ধো*ন দিয়ে চুদি 🤣🤣😂",
      " ────তোর মারে চুইদা জীবনের সবচাইতে বড় ভুল করছিলাম আর এই ভুলের সাজা এখন পেতে হচ্ছে। তোর মত বিশ্বা জন্ম হইয়া। 🙂😝",
      " তর মারে জনগণের মধ্যে ফালাইয়া চোদবো 😹👋",
      " ______ মাগি পাড়ার ছিঁড়া কন্ডম দিয়ে তোর বোনরে চোদি!-)🤣🤣",
      " তোর মারে পাকিস্তানের সাবেক প্রেসিডেন্ট ট্রাম্প প্রশাসন সেজে চুদি",
      "শীতের কম্পলের তোলে ফালাইয়া তোর মায়রে ধ!র্ষণ করবো উজানী মা!গীর ছেলে 🥵💦",
      " তোর মায়রে উড়ন্ত ✈️বিমানে 💤ঘুমন্ত অবস্থায় লেংটা করে সুদী 🥵💦",
      " ─── এই কাইল্লা ফাডা খানকির ছেলে আমার ১২ ইঞ্চি ধন দিয়া এমন বাড়ি দিমু তর বাবার নাম ভুলে যাবি খানকির ছেলে কমেন্ট বক্সে আব্লামি করিস কেন সুয়ারের ৪ নাম্বার বাচ্চা -)😹💨",
      " নাস্তিক।🦶😹 _____ তোর বোনের ভোদায় ওয়াক থু নডির বাচ্চা",
      " ⎯⎯⎯ এ নাস্তিক মাগির ছেলে তোর মারে হিন্দু বৌদ্ধ খ্রিস্টান দিয়ে চুদাবো😹✋",
      " তর মারে গুলিস্তানের অলিতে গলিতে চিপায় চাপায় লেংটা করে চুদি 😹",
      " ────তোর মার কপালে জুতা দিয়া পিটাইতে হইবো ওই খানকিমাগী কেন তোরে জন্ম দিলো।🙂😊🎀",
      " ⎯⎯⎯ এ মাগীরপুত তোর মারে ঠাকুরগাঁও নিয়ে ঠাকুর দিয়ে চুদবো!😹✋",
      " কালা ফাডা মাগির ছেলে",
      " তর মারে চুদি মাগির ছেলে ৩। ফুট 😹👋",
      "___বৈশাখী ঝরের মধ্যে তোর মাকে মাঠে ফেলে চুদিহহহ বান্ধির ছেলে-//🌽🐹🍾🧜‍♀️ ",
      " তর মারে কুকুর দিয়ে চুদাবো মাগির ছেলে 🥵",
      " ️️️️️⎯⎯  তোর মার বোদার মাংস কাইট্টা কুত্তারে খানকির ছেলে সিন দে তোর মাকে হিরো আলমকে দিয়া চোদাবো সিন না দিলে।😹🖐️",
      " ️️️️️⎯⎯ কিরে বান্দির ছেলে তুই নাকি হ্যাকার তোর মার ভোঁদার মধ্যে দাঁড়াইয়া মুইতা দিমু।🙄💔",
      "—♡শেষ নিশ্বাস পর্যন্ত আপনার মাকে চুদতে  চাই কি বলেন আপনি-!! ">"♡🩷🙂🫶 ",
      " ️️️️️⎯⎯   কিরে পা চাটা কুত্তা মাগির ছেলে ? তোর মারে নাকি তোর দাদা সুদে।😔😦",
      " ___তর মার ভুদায় ডিজেল ডেলে আগুুন লাগিয়া  দূর দিমো মাগির ছেলে  //🌽🐹🍾🧜‍♀️",
      " তর মারে ১২ মাস চুদে গেলেও ওর ভোদার কিছু হবে না কারন মাগি তো ভোদা লোহা বানায় দিছে 😹💥🦶",
      "😹_____ তোর কচি বোনকে বিয়ে দিবি রেন্ডি মাগির বাচ্চা!👅 ",
      "খাংকির পোলা তর মারে চুদি 🥰।"
"খাংকির পোলা তর কচি বোন রে চুদি 😍.."
"মাদারচোদ তর আম্মু পম পম খাংকির পো 🐰"
"খাংকির পোলা তর কচি ভুদায় ভুদায় কামর দিমু 💔!"
"খাংকি মাগির পোলা কথা ক কম কম তর আম্মু রে চুদে বানামু আইটেম বোম"
"depression থেকেও তর মাইরে চু*** দি 🤬"
"তর আম্মু রে আচার এর লোভ দেখি চুদি মাগির পোলা🤬"
"বান্দির পোলা তর কচি বোনের ভুদা ফাক কর থুতু দিয়ে ভুদায় দন ডুকামু 🤟"
"বান্দি মাগির পোলা তর আম্মু রে চুদি তর দুলা ভাই এর কান্দে ফেলে 🤝"
"উফফফ খাদ্দামা মাগির পোলা তর আম্মুর কালা ভুদায় আমার মাল আউট তর কচি বোন রে উপ্তা করে এবার চুদবো 💉।"
"অনলাইনে গালি বাজ হয়ে গেছত মাগির পোলা এমন চুদা দিমু লাইফ টাইম মনে রাখভি আবির তর বাপ মাগির ছেলে 😘।"
"বাতিজা শুন তর আম্মু রে চুদলে রাগ করবি না তো আচ্ছা জা রাগ করিস না তর আম্মুর কালা ভুদায় আর চুদলাম না তো বোন এর জামা টা খুলে দে ✋"
"হাই মাদারচোদ তর তর ব্যাশা জাতের আম্মু টা রে আদর করে করে চুদি"
"~ চুদা কি আরো খাবি মাগির পোল 🤖"
"খাংকির পোলা 🥰।"
"মাদারচোদ😍.."
"ব্যাস্যার পোলা 🐰"
"ব্যাশ্যা মাগির পোলা 💔!"
"পতিতা মাগির পোলা"
"তর মারে চুদি"
"নাট বল্টু মাগির পোলা🤟"
"তর বোন রে পায়জামা খুলে চুদি 🤣"
"উম্মম্মা তর বোন এরকচি ভুদায়💉।"
"DNA টেষ্ট করা দেখবি আমার চুদা তেই তর জন্ম।"
"কামলা মাগির পোলা ✋"
"বাস্ট্রাড এর বাচ্ছা বস্তির পোলা"
"~ আমার জারজ শন্তান🤣"
"Welcome মাগির পোলা 🥰।"
"তর কচি বোন এর পম পম😍.."
"ব্যাস্যার পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰"
"Hi জারজ মাগির পোলা 💔 তর মারে কনডম ছাড়া চুদি! 🥵"
"২০ টাকা এ পতিতা মাগির পোলা"
"বস্তির ছেলে অনলাইনের কিং"
"টুকাই মাগির পোলা🤟"
"তর আম্মু রে পায়জামা খুলে চুদি 🤣"
"হিজলা মাগির পোলা ✋"
"বস্তিরন্দালাল এর বাচ্ছা বস্তির পোলা"
"~ আমার জারজ শন্তান জা ভাগ🤖"
"Welcome শুয়োরের বাচ্চা 🥰।"
"কুত্তার বাচ্ছা তর কচি বোন এর পম পম😍.."
"খাঙ্কিরপোলা পোলা কথা শুন তর আম্মু রে চুদি গামছা পেচিয়ে🐰"
"জারজ মাগির পোলা 💔!"
"খান্কি মাগির পোলা"
"তোর বাপে তোর নানা। 🤬"
"বস্তির ছেলে তোর বইনরে মুসলমানি দিমু।"
"টুকাই মাগির পোলা মোবাইল ভাইব্রেশন কইরা তুর কচি বোন এর পুকটিতে ভরবো।🤟"
"তোর মুখে হাইগ্যা দিমু। 🤣"
"কুত্তার পুকটি চাটামু💉।"
"তর আম্মুর হোগা দিয়া ট্রেন ভইরা দিমু।।"
"হিজলা মাগির পোলা হাতির ল্যাওড়া দিয়া তর মায়েরে চুদুম। ✋"
"তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু।"
"~ আমার ফাটা কন্ডমের ফসল। জা ভাগ🤖"
"কুত্তার বাচ্ছা তর বৌন ভোদায় মাগুর মাছ চাষ করুম।😍.."
"খাঙ্কিরপোলা পোলা তর বোনের হোগায় ইনপুট, তর মায়ের ভোদায় আউটপুট।🐰"
"তর মায়ের ভোদা বোম্বাই মরিচ দিয়া চুদামু।💔!"
"খান্কি মাগির পোলা তর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা দিমু।"
"জং ধরা লোহা দিয়া পাকিস্তানের মানচিত্র বানাই্য়া তোদের পিছন দিয়া ঢুকামু।🤬"
"বস্তির ছেলে তর মায়ের ভুদাতে পোকা।"
"টুকাই মাগির পোলা তর মার ভোদায় পাব্লিক টয়লেট।🤟"
"তোর মুখে হাইগ্যা দিমু। ভুস্কি মাগির পোলা 🤣"
"কান্দে ফালাইয়া তর মায়েরে চুদি💉।"
"তর আম্মুর উপ্তা কইরা চুদা দিমু।।"
"হিজলা মাগির পোলা বালি দিয়া চুদমু তরে খাঙ্কি মাগী!তর মাকে।"
"তর বোন ভোদা ছিল্লা লবণ লাগায় দিমু।"
"~ আমার পুত। জা ভাগ🤖",
    ];

    activeMurgi.set(event.threadID, true);
    message.reply("🔥 Murgi mode started.");

    try {
      while (activeMurgi.get(event.threadID)) {
        for (const msg of messages) {
          if (!activeMurgi.get(event.threadID)) break;

          await delay(2500);
          message.reply({
            body: `${name}\n${msg}`,
            mentions: arraytag
          });
        }
      }
    } catch (err) {
      console.error(err);
      activeMurgi.delete(event.threadID);
      message.reply("Something went wrong!");
    }
  }
};
